[

    {
        "_id": "robertsonplumbingltd",
        "project_name": "Robertson Plumbing Solutions LTD",
        "project_type": "UX Design, Web Design",
        "date": "2025",
        "short_description": "This was created using VSCode",
        "extended_description": "<p>Recent project for Robertson Plumbing Solutions NZ </p><br><p> Designed + built a clean, mobile-friendly site to showcase their services and recent work. </p><br> <p>Really loved how this one turned out! </p>"
        ,
        "project_images": [
            "/project-img/plumbing-mockup.png",
            "/project-img/plumbing-mockup-1.png"
        ],
        "skills_used": "VSCode | HTML | CSS | Javascript | GitHub | React",
        "link": "https://www.robertsonplumbing.nz/",
        "is_featured": true,
        "is_favourite": false
    },
    {
        "_id": "dreamynotesmusicplayer",
        "project_name": "DreamyNotes Music Player",
        "project_type": "UX Design, Web Design",
        "date": "2025",
        "short_description": "This was created using VSCode",
        "extended_description": "<p>DreamyNotes is a personal music player I designed and coded, blending playful design with soothing digital experiences. Featuring a pastel, gamified interface with rounded buttons, pastel progress bars, and album highlights, it creates a calming yet engaging music experience.</p><br> <p>Built entirely in React, the app includes interactive elements like play/pause controls, skip buttons, progress bars, and dynamic song timers, with intuitive navigation and responsive layouts for mobile devices.</p><br> <p>This project demonstrates my ability to merge coding and design, creating functional, visually immersive digital experiences while showcasing modern front-end development and UX skills.</p>"
        ,
        "project_images": [
            "/project-img/music-player-mockup(1).png",
            "/project-img/music-player-mockup(2).png",
            "/project-img/music-player-mockup(3).png",
            "/project-img/music-player-mockup(4).png"
        ],
        "skills_used": "VSCode | MP3JUICE | HTML | CSS | Javascript | GitHub | React",
        "link": "https://dreamynotes-music-player.vercel.app/",
        "backend_link": "https://github.com/caitlinanderson099/dreamynotes_music_player",
        "frontend_link": "https://mp3juice.co/",
        "is_featured": true,
        "is_favourite": false
    },

     {
        "_id": "fableandcotoys",
        "project_name": "Fable & Co Children's Toys and Storytelling",
        "project_type": "Branding & Identity Design",
        "date": "2025",
        "short_description": "This was created using Figma",
        "extended_description": "<p>Fable Co. is a fictional brand concept I developed to explore the intersection of playful design and whimsical storytelling. The brand represents a children’s toy and storytelling shop that sparks imagination through enchanting visuals, cozy atmospheres, and magical details.</p><br><p>The visual identity draws inspiration from fairy tales and childhood wonder, using a palette of deep midnight blue, golden amber, and soft pastels to balance mystery with warmth. Key brand motifs—such as storybooks, stars, lanterns, and teddy bears—help create a sense of wonder and adventure that appeals to both children and parents.</p><br><p>I designed this project entirely in Figma, building out the brand identity system, storefront aesthetic, and supporting visuals. Figma’s vector tools and component libraries allowed me to experiment with playful iconography, cohesive color hierarchies, and layout variations that could be applied consistently across touchpoints.</p><br><p>This project demonstrates my ability to craft an immersive brand experience —from color psychology and typography to icon design and storytelling-driven visuals—while also showcasing my skills in using Figma as a professional design tool.</p>"
        ,
        "project_images": [
            "/project-img/brand-designing-mockup.png"
        ],
        "skills_used": "Figma",
        "is_featured": true,
        "is_favourite": false
    },

    {
        "_id": "afterglowmenus",
        "project_name": "Afterglow Bar Menu Design",
        "project_type": "Graphic Design",
        "date": "2025",
        "short_description": "This was created using Canva",
        "extended_description": "<p>Crafted with elegance and clarity in mind the Afterglow Bar's drink menus present a modern upscale aesthetic that reflects the sophistication of the brand. Designed in Canva the layout uses a clean and minimalist approach with stylish serif fonts and custom cocktail illustrations—balancing professionalism with a playful edge.</p><br><p>The menu is split into two sections:</p><br><p><strong>Mocktail Menu</strong> – A vibrant selection of non-alcoholic blends featuring creative drinks like Berry Breeze, Golden Hour and Jungle Juice. Each option includes core ingredients and clear pricing for easy browsing.</p><br><p><strong>Cocktail Menu</strong> – A curated collection of classics and house favorites including refreshing choices like Mojito and Moscow Mule alongside timeless options such as Aperol Spritz, White Russian, Sex on the Beach, Blue Lagoon, Cosmopolitan and Rum Punch. Each drink is listed with its ingredients and consistent pricing for a refined look.</p><br><p>Both menus are designed for readability while evoking the relaxed yet sophisticated atmosphere of Afterglow Bar. The cohesive branding elegant typography and balanced visuals make this menu set functional and visually engaging—ideal for both print and digital display.</p>"
,
        "project_images": [
            "/project-img/afterglow-menu-mockup(1).png",
            "/project-img/afterglow-menu-mockup(2).png",
            "/project-img/afterglow-menu-mockup(3).png",
            "/project-img/afterglow-menu-mockup(4).png",
            "/project-img/afterglow-menu-mockup(5).png"
        ],
        "skills_used": "Canva",
        "is_featured": true,
        "is_favourite": false
    },

    {
        "_id": "fermentedbarandeateryposters",
        "project_name": "Fermented Bar & Eatery Posters *Updated*",
        "project_type": "Graphic Design",
        "date": "2025",
        "short_description": "This was created using Canva",
        "extended_description": "<p><em>Created for work purposes.</em> I designed these promotional posters for Fermented Bar & Eatery in Brewtown, Upper Hutt. The Fermented staff wanted to attract more customers with their daily specials on food and drinks, so they asked me to create posters that would help increase engagement. After meeting with management to discuss the desired style, we decided on a colourful and playful design that would appeal to people of all ages.</p><br><p><strong>Posters created:</strong></p><p><strong>Wednesday:</strong> Buy 1 Pizza, Get Free Fries</p><p><strong>Wednesday Night:</strong> Believe It or Not Quiz Nights</p><p><strong>Thursday – Tradie Thursday:</strong> Come in wearing a work uniform and get house beers & wines from $9</p><p><strong>Friday & Saturday – Fun Day:</strong> Get $10 Classic Shots & $12 Classic Cocktails</p><p><strong>Sunday:</strong> Get 2 Regular Bubble Teas for $15</p>"
,
        "project_images": [
            "/project-img/poster-mockup(8).png",
            "/project-img/poster-mockup(9).png",
            "/project-img/poster-mockup(10).png",
            "/project-img/poster-mockup(7).png",
            "/project-img/poster-mockup(2).png",
            "/project-img/poster-mockup(3).png",
            "/project-img/poster-mockup(4).png",
            "/project-img/poster-mockup(5).png",
            "/project-img/poster-mockup(6).png"
        ],
        "skills_used": "Canva",
        "is_featured": true
    },

    {
        "_id": "theyolkclock",
        "project_name": "The Yolk Clock",
        "project_type": "Web Design, UX Design",
        "date": "2025",
           "extended_description": "The Yolk Clock is a fun and interactive egg timer website designed to take the guesswork out of cooking the perfect egg. Inspired by nostalgic kitchen gadgets with a modern digital twist, it features a bright, cheerful interface with playful egg-themed visuals and a user-friendly layout. Users can choose their preferred style of egg—soft-boiled, medium, hard, poached, or fried—with preset cooking times that can be adjusted to suit personal tastes. A real-time countdown timer keeps users on track, and when time’s up, a built-in alarm with sound ensures you never miss the perfect moment. With smooth animations and satisfying sound cues, The Yolk Clock brings joy to your kitchen routine while ensuring every egg comes out just right. Whether you're a breakfast lover or a brunch perfectionist, this site adds a dash of charm to your culinary experience."
,

        "project_images": [
            "/project-img/yolk-clock-mockup1.png",
            "/project-img/yolk-clock-mockup2.png"
        ],
        "skills_used": "VSCode | HTML | CSS | JavaScript | GitHub | React + Vite | PixaBay",
        "link": "https://the-yolk-clock.vercel.app/",
        "backend_link": "https://github.com/caitlinanderson099/the_yolk_clock",
        "frontend_link": "https://pixabay.com/sound-effects/search/alarm/",
        "is_featured": true,
        "is_favourite": true
    },

    {
        "_id": "mytodolist",
        "project_name": "My To Do List",
        "project_type": "Web Design, UX Design",
        "date": "2025",
        "extended_description": "This app was created using React + Vite to allow users to use the app for all of their to do list needs. Using localStorage, users can refresh and come back to site and still have their tasks stored. Users can create a task, edit the task, delete the task and check off their tasks by a simple click of a button. Users can also toggle between light mode and dark mode for extra accessiblity.",
        "project_images": [
            "/project-img/todo-mockup.png"
        ],
        "skills_used": "VSCode | React + Vite | GitHub | Vercel",
        "link": "https://todo-app-six-iota-39.vercel.app/",
        "backend_link": "https://github.com/caitlinanderson099/todo-app",
        "is_featured": true
    },

    {
        "_id": "lesavorrecipefinder",
        "project_name": "Le Savor Recipe Finder API",
        "project_type": "Web Design, UX Design",
        "date": "2025",
        "short_description": "This was created using the Spoonacular API",
        "extended_description": "This website was created for my personal educational purposes. Using Spoonacular API, I created this website Le Savor. Le Savor is a recipe finding website that assists users in finding the perfect recipe for their needs. Le Savor has a fictional owner named Danny. Danny loves to create masterpieces with food and strives to help others find their own love with cooking. I had created this website to continue honing in on my skills using Axios Calls, React + Vite, and JavaScript.",
        "project_images": [
            "/project-img/recipe-mockup(1).png",
            "/project-img/recipe-mockup(2).png",
            "/project-img/recipe-mockup(3).png",
            "/project-img/recipe-mockup(4).png",
            "/project-img/recipe-mockup(5).png"
        ],
        "skills_used": "VSCode | React + Vite | GitHub | Vercel | Canva | Spoonacular API",
        "link": "https://le-savour-recipe-finder.vercel.app/",
        "backend_link": "https://spoonacular.com/food-api",
        "frontend_link": "https://github.com/caitlinanderson099/recipe-finder-using-api",
        "is_featured": true,
        "is_favourite": false
    },

    {
        "_id": "bebabohairstudionz",
        "project_name": "Be Ba Bo Hair Studio",
        "project_type": "Web Design, UX Design",
        "date": "2024",
        "disclaimer": "<strong>Disclaimer:</strong> This project was created for educational purposes",
        "short_description": "This was created for an assessment to redesign a website for a small local business. Be Ba Bo Hair Studio is a hair salon located in New Plymouth New Zealand. Owned by Janine Marshall-Johnson.",
        "extended_description": "I had created this website during my Summative 4.1 assessment in the Content Management Systems Module. Our brief was to create a redesigned website for a non profit organization or local business needing an online presence. As well as creating a customizable WordPress theme for the client. I had chosen Be Ba Bo Hair Studio located in New Plymouth, New Zealand. I wanted to give them a website that reflected their brand values and create accessibility for all users of the website. I had used Figma to help with the pre production, VSCode to develop the website, and Vercel and WordPress to deploy the website and allow it be customized. Down below are links to the deployed site, as well as the backend and frontend GitHub repositories.",
        "project_images": [
            "/project-img/be-ba-bo-mockup(1).png",
            "/project-img/be-ba-bo-mockup(2).png",
            "/project-img/be-ba-bo-mockup(3).png",
            "/project-img/be-ba-bo-mockup(4).png"
        ],
        "skills_used": "VSCode | React + Vite | WordPress | GitHub | Figma | Vercel",
        "link": "https://be-ba-bo-hair-studio.vercel.app/",
        "backend_link": "https://github.com/caitlinanderson099/be-ba-bo-custom-theme",
        "frontend_link": "https://github.com/caitlinanderson099/be-ba-bo-hair-studio",
        "is_featured": true
    },

    {
        "_id": "forestandbirdnz",
        "project_name": "Forest & Bird NZ",
        "project_type": "Web Design, UX Design",
        "date": "2024",
        "disclaimer": "<strong>Disclaimer:</strong> This project was created for educational purposes",
        "project_brief": "The brief for this code demo was to create a property finder using basic code functions allowing users to input their information for properties, filter them by the inputs, and display it.",
        "short_description": "This was created for an assessment to redesign a website for a non-profit organisation in New Zealand. Forest and Bird Nz is a foundation dedicated to protecting and preserving the integrity of New Zealand's wildlife and wild lands.",
        "extended_description": "I had created this website during my Formative 4.1 assessment in the Content Management Systems Module. The brief was to redesign the current website for a non-profit organization, while also taking into account the cultural and sociological issues that they are facing. I had chosen Forest & Bird NZ and the issues of, cultural sensitivity and public awareness, and, conservation vs consumerism and eco-tourism.My objective was to redesign the navigational system and layout of the website to a more concise and minimal look which included the more relevant information for the organization. This website was created utilizing Wordpress and its Plugins (WooCommerce, ACF, CoCart, CPT, and SCF), as well as React Vite for the frontend.",
        "project_images": [
            "/project-img/forest-and-bird-mockup(1).png",
            "/project-img/forest-and-bird-mockup(2).png",
            "/project-img/forest-and-bird-mockup(3).png",
            "/project-img/forest-and-bird-mockup(4).png"
        ],
        "skills_used": "VSCode | HTML | CSS | Javascript | GitHub | Figma | Vercel",
        "link": "https://forestandbirdformative4-1.vercel.app/",
        "frontend_link": "https://github.com/caitlinanderson099/forestandbirdformative4.1",
        "is_featured": true
    },

    {
        "_id": "jewellerysupreme",
        "project_name": "Jewellery Supreme Store",
        "project_type": "Web Design",
        "date": "2024",
        "disclaimer": "<strong>Disclaimer:</strong> This project was created for educational purposes",
        "description": "I had created 'Jewellery Supreme' for my Formative 2.2 assessment in the Foundation Coding Module.",
        "project_brief": "The brief for this project, Formative 2.2, is to create a website that will implement use cases such as; View List, View Details, and Filter Items By Category. As well as Using Javascript to manipulate the DOM, implement simple algorithms, and use a variety of production tools.",
        "extended_description": "I had created 'Jewellery Supreme' for my Formative 2.2 assessment in the Foundation Coding Module. The brief for this project was to create a website utilizing Jquery and it's libraries including Fullpage and Mapbox. In creation of this project, I took heavy inspiration from the current website for Lovisa jewellery as well as a design layout for jewellery that I had found on Pinterest. I wanted to create something the portrayed high end style so I used some of Lovisa's jewellery items to help that portrayal. Throughout this project I had the chance to learn about time management and how to utilize the resources accordingly. Using Mapbox really helped to make this project feel more 'real world' and not only something I created in a classroom. Creating this project within two weeks helped me to be more diligent with my time and plan stages accordingly and stick to them.",
        "project_images": [
            "/project-img/jewellery-supreme-mockup(1).png",
            "/project-img/jewellery-supreme-mockup(2).png",
            "/project-img/jewellery-supreme-mockup(3).png",
            "/project-img/jewellery-supreme-mockup(4).png"
        ],
        "skills_used": "Figma | GitHub | VSCode | HTML | CSS | Javascript | Fullpage Js | Time Management | Problem Solving",
        "link": "https://formative-2-2-single-page-app.vercel.app/",
        "is_featured": true,
        "is_favourite": true
    },

    {
        "_id": "pokedexapi",
        "project_name": "Pokedex API",
        "project_type": "UX Design",
        "date": "2024",
        "disclaimer": "<strong>Disclaimer:</strong> This project was created for educational purposes",
        "description": "I had created 'Jewellery Supreme' for my Formative 2.2 assessment in the Foundation Coding Module.",
        "project_brief": "The brief for this project, Formative 2.2, is to create a website that will implement use cases such as; View List, View Details, and Filter Items By Category. As well as Using Javascript to manipulate the DOM, implement simple algorithms, and use a variety of production tools.",
        "extended_description": "For this particular project, we were practising how to grab data from an API. In this case, it was for the Pokemon Pokedex which allows viewers to search the type of Pokemon they wish and read up on their special powers and traits. This project was an introduction into grabbing data through an Axios call to an existing API.",
        "project_images": [
            "/project-img/pokedex-mockup(1).png",
            "/project-img/pokedex-mockup(2).png",
            "/project-img/pokedex-mockup(3).png",
            "/project-img/pokedex-mockup(4).png"
        ],
        "skills_used": "VSCode | HTML | CSS | Javascript | React | Axios | Data API's",
        "link": "https://pokedex-react-app-silk.vercel.app/",
        "frontend_link": "https://github.com/caitlinanderson099/pokedex-react-app",
        "is_featured": true
    },

    {
        "_id": "newsapi",
        "project_name": "News API",
        "project_type": "UX Design",
        "date": "2024",
        "disclaimer": "<strong>Disclaimer:</strong> This project was created for educational purposes",
        "description": "I had created 'Jewellery Supreme' for my Formative 2.2 assessment in the Foundation Coding Module.",
        "project_brief": "The brief for this project, Formative 2.2, is to create a website that will implement use cases such as; View List, View Details, and Filter Items By Category. As well as Using Javascript to manipulate the DOM, implement simple algorithms, and use a variety of production tools.",
        "extended_description": "For this particular project, we were practising how to grab data from an API. In this case, it was for the News API which is a website where you can grab any and all news data and plug it into your code using a code key. This project was an introduction into grabbing data through an Axios call to an existing API.",
        "project_images": [
            "/project-img/news-mockup(1).png",
            "/project-img/news-mockup(2).png",
            "/project-img/news-mockup(3).png"
        ],
        "skills_used": "VSCode | HTML | CSS | Javascript | React | Axios | Data API's",
        "link": "https://github.com/caitlinanderson099/formative-news-app",
        "is_featured": true
    },

    {
        "_id": "artoffoodredesign",
        "project_name": "Art of Food",
        "project_type": "Web Design, UX Design",
        "date": "2024",
        "disclaimer": "<strong>Disclaimer:</strong> This project was created for educational purposes",
        "project_brief": "The brief for this project, Summative 1.1 assessment, is to implement the design from the previous chosen scenario we had into a functional webapp using web technologies to create an easier user experience.",
        "description": "This was created by the Pusheen Team as a group project for our Formative 1.1 and Summative 1.1 assessments in the UX Design Module.",
        "extended_description": "This was created by the Pusheen Team as a group project for our Formative 1.1 and 1.2 assessments in the UX Design Module. Our group consisted of myself, Baxter, and Kristine. The brief was essentially to redesign the Ui and Ux of a current hospitality website. We all decided to choose the website for Upper Hutt's Art of Food restaurant as it wasn't very user-friendly or pleasing to the eye. During this project I had learnt a lot about taking on a leadership role as well how to work together in a team. Our group worked well together, communicating our ideas and compromising ono important aspects for the users journey through the website. In creation of this project, we first used the Figma software to create Hifi designs and prototypes before moving onto coding the website by hand using vanilla HTML and CSS using the software VSCode.",
        "project_images": [
            "/project-img/art-of-food-mockup(1).png",
            "/project-img/art-of-food-mockup(2).png",
            "/project-img/art-of-food-mockup(3).png",
            "/project-img/art-of-food-mockup(4).png"
        ],
        "skills_used": "Figma | GitHub | VSCode | HTML | CSS | Team Work | Time Management | Communication | Problem Solving",
        "link": "https://formative-1-2-weld.vercel.app/",
        "is_featured": true
    },

    {
        "_id": "huttvalleytaxis",
        "project_name": "Hutt Valley Taxis LTD",
        "project_type": "Graphic Design",
        "date": "2023",
        "disclaimer": "<strong>Disclaimer:</strong> This project was created for educational purposes",
        "project_brief": "The brief for this project, Summative 1.1 assessment, is to implement the design from the previous chosen scenario we had into a functional webapp using web technologies to create an easier user experience.",
        "description": "This was created by the Pusheen Team as a group project for our Formative 1.1 and Summative 1.1 assessments in the UX Design Module.",
        "extended_description": "This logo redesign was created in 2023 as part of a class assessment focused on brand identity. The brief required us to select a local business with outdated branding and modernize its logo while keeping it recognizable. I chose Hutt Valley Taxis because their existing logo lacked visual impact and did not reflect the professionalism of their service.",
        "project_images": [
            "/project-img/business-card-mockup(1).png",
            "/project-img/business-card-mockup(2).png"
        ],
        "skills_used": "Time Management | Adobe Illustrator | Adobe PhotoShop",
        "is_featured": true
    },
    
    {
        "_id": "simshamburgercakebox",
        "project_name": "Sims Hamburger Cake Box",
        "project_type": "Packaging Design, Graphic Design",
        "date": "2023",
        "disclaimer": "<strong>Disclaimer:</strong> This project was created for educational purposes",
        "project_brief": "The brief for this project, Summative 1.1 assessment, is to implement the design from the previous chosen scenario we had into a functional webapp using web technologies to create an easier user experience.",
        "description": "This was created by the Pusheen Team as a group project for our Formative 1.1 and Summative 1.1 assessments in the UX Design Module.",
        "extended_description": "This project was created as the final assessment for my Level 5 Web and Graphic Design course. I designed a custom cake box inspired by the hamburger cake from The Sims game franchise. The goal was to combine packaging design with pop culture elements, translating a virtual object into a functional and visually engaging real-world product.",
        "project_images": [
            "/project-img/cake-box-mockup(1).png",
            "/project-img/cake-box-mockup(2).png",
            "/project-img/cake-box-mockup(3).png",
            "/project-img/cake-box-mockup(4).png",
            "/project-img/cake-box-mockup(5).png"


        ],
        "skills_used": "Time Management | Adobe Illustrator | Problem Solving",
        "is_featured": true,
        "is_favourite": true
    }
]